In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
SERVER = 'DESKTOP-LQOJV4Q\SQLEXPRESS'
DATABASE = 'master'
DRIVER = 'ODBC Driver 17 for SQL Server'
DATABASE_CONNECTION = f'mssql://@{SERVER}/{DATABASE}?driver={DRIVER}'
engine = create_engine(DATABASE_CONNECTION)

In [3]:
#conn = engine.connect()
#df = pd.read_sql_query("select * from [dbo].[cd_data]", conn)

In [15]:
#df = pd.read_sql_table("sample_data", engine)
df = pd.read_sql_table("cd_data", engine, columns = ['alldate', 
                                                        'product_id', 
                                                        'product_name', 
                                                        'customer_id', 
                                                        'customer_name',
                                                        'supplier_id',
                                                        'supplier_name',
                                                        'category',
                                                        'sale_quantity',
                                                        'revenue',
                                                        'profit',
                                                        'stock_quantity',
                                                        'cost_of_stock'])
df.head(5)

,alldate,product_id,product_name,customer_id,customer_name,supplier_id,supplier_name,category,sale_quantity,revenue,profit,stock_quantity,cost_of_stock
0,2020-03-01,17677.0,товар 17677,1763.0,клиент 1763,153.0,поставщик 153,категория 01,3.0,489.0,None,NULL,NULL
1,2020-03-01,18016.0,товар 18016,1763.0,клиент 1763,153.0,поставщик 153,категория 01,3.0,8343.0,None,NULL,NULL
2,2020-03-01,17695.0,товар 17695,1763.0,клиент 1763,153.0,поставщик 153,категория 01,3.0,489.0,None,NULL,NULL
3,2020-03-01,17711.0,товар 17711,1763.0,клиент 1763,153.0,поставщик 153,категория 01,3.0,489.0,None,NULL,NULL
4,2020-03-01,18046.0,товар 18046,1763.0,клиент 1763,153.0,поставщик 153,категория 01,3.0,8343.0,None,NULL,NULL

In [16]:

query = '''
        SELECT YEAR(alldate) год,
               MONTH(alldate) месяц,
               ROUND(SUM(revenue), 0) выручка
        FROM cd_data
        WHERE YEAR(alldate)in (2017, 2018)
        GROUP BY YEAR(alldate), MONTH(alldate)
        ORDER BY 1, 2
    '''
df_1718 = pd.read_sql(query, engine)
df_1718

     год  месяц    выручка
0   2017      1  2121083.0
1   2017      2  2220456.0
2   2017      3  3084616.0
3   2017      4  3053788.0
4   2017      5  3002209.0
5   2017      6  3214419.0
6   2017      7  2883786.0
7   2017      8  3798965.0
8   2017      9  3981580.0
9   2017     10  4369178.0
10  2017     11  4403257.0
11  2017     12  4026273.0
12  2018      1  3615404.0
13  2018      2  3927993.0
14  2018      3  4379614.0
15  2018      4  4256322.0
16  2018      5  5119291.0
17  2018      6  5239645.0
18  2018      7  5381582.0
19  2018      8  5950750.0
20  2018      9  5805484.0
21  2018     10  6445994.0
22  2018     11  6381862.0
23  2018     12  5774529.0

In [10]:
query_product = '''
        SELECT product_id, product_name, supplier_id, supplier_name, category
        FROM cd_data
        GROUP BY product_id, product_name, supplier_id, supplier_name, category
    '''
df_product = pd.read_sql(query_product, engine)
df_product

      product_id product_name  supplier_id  supplier_name      category
0        10006.0  товар 10006        100.0  поставщик 100  категория 99
1        10012.0  товар 10012        100.0  поставщик 100  категория 99
2        10036.0  товар 10036        100.0  поставщик 100  категория 99
3        10038.0  товар 10038        100.0  поставщик 100  категория 99
4        10048.0  товар 10048        100.0  поставщик 100  категория 99
...          ...          ...          ...            ...           ...
4353     18330.0  товар 18330        153.0  поставщик 153  категория 01
4354     18333.0  товар 18333        153.0  поставщик 153  категория 01
4355     18334.0  товар 18334        153.0  поставщик 153  категория 01
4356     18338.0  товар 18338        153.0  поставщик 153  категория 07
4357     18343.0  товар 18343        153.0  поставщик 153  категория 06

[4358 rows x 5 columns]